balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ256GB110.PIC
<?xml version="1.0" ?><edc:PIC edc:arch="24xxxx" edc:desc="" edc:informedby="DOS PS DS" edc:isextended="false" edc:name="PIC24FJ256GB110" edc:procid="0x0079" xmlns:edc="http://crownking/edc" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://crownking/edc edc/PIC.xsd">
  <edc:Power>
    <edc:VPP edc:defaultvoltage="3.250" edc:maxvoltage="3.500" edc:minvoltage="2.000"/>
    <edc:VDD edc:maxdefaultvoltage="3.500" edc:maxvoltage="3.500" edc:mindefaultvoltage="2.000" edc:minvoltage="2.000" edc:nominalvoltage="3.250"/>
  </edc:Power>
  <edc:Programming edc:memtech="ee" edc:tries="1">
    <edc:Wait edc:cfg="10000" edc:eedata="10000" edc:erase="600" edc:pgm="10000" edc:userid="10000"/>
    <edc:Latches edc:cfg="2" edc:eedata="2" edc:pgm="64" edc:rowerase="512"/>
  </edc:Programming>
  <edc:ArchDef edc:desc="24xxxx" edc:name="24xxxx">
    <edc:MemTraits>
      <edc:CodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ExtCodeMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:BackgroundDebugMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xff7fff" edc:wordsize="0x4"/>
      <edc:TestMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:UserIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffffff" edc:wordinit="0xffffff" edc:wordsafe="0xffffff" edc:wordsize="0x4"/>
      <edc:ConfigFuseMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:DeviceIDMemTraits edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0xffff" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
      <edc:EEDataMemTraits edc:magicoffset="0x0"/>
      <edc:DataMemTraits edc:addrinc="0x2" edc:locsize="0x2" edc:wordimpl="0xffff" edc:wordinit="0x0" edc:wordsafe="0xffff" edc:wordsize="0x2"/>
    </edc:MemTraits>
  </edc:ArchDef>
  <edc:InterruptList>
    <edc:Trap edc:cname="ReservedTrap0" edc:desc="Reserved"/>
    <edc:Trap edc:cname="OscillatorFail" edc:desc="Oscillator Fail Trap Vector"/>
    <edc:Trap edc:cname="AddressError" edc:desc="Address Error Trap Vector"/>
    <edc:Trap edc:cname="StackError" edc:desc="Stack Error Trap Vector"/>
    <edc:Trap edc:cname="MathError" edc:desc="Math Error Trap Vector"/>
    <edc:Trap edc:cname="ReservedTrap5" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap6" edc:desc="Reserved"/>
    <edc:Trap edc:cname="ReservedTrap7" edc:desc="Reserved"/>
    <edc:Interrupt edc:cname="INT0Interrupt" edc:desc="INT0 - External Interrupt 0" edc:irq="0"/>
    <edc:Interrupt edc:cname="IC1Interrupt" edc:desc="IC1 - Input Capture 1" edc:irq="1"/>
    <edc:Interrupt edc:cname="OC1Interrupt" edc:desc="OC1 - Output Compare 1" edc:irq="2"/>
    <edc:Interrupt edc:cname="T1Interrupt" edc:desc="T1 - Timer1" edc:irq="3"/>
    <edc:Interrupt edc:cname="IC2Interrupt" edc:desc="IC2 - Input Capture 2" edc:irq="5"/>
    <edc:Interrupt edc:cname="OC2Interrupt" edc:desc="OC2 - Output Compare 2" edc:irq="6"/>
    <edc:Interrupt edc:cname="T2Interrupt" edc:desc="T2 - Timer2" edc:irq="7"/>
    <edc:Interrupt edc:cname="T3Interrupt" edc:desc="T3 - Timer3" edc:irq="8"/>
    <edc:Interrupt edc:cname="SPI1ErrInterrupt" edc:desc="SPI1E - SPI1 Error" edc:irq="9"/>
    <edc:Interrupt edc:cname="SPI1Interrupt" edc:desc="SPI1 - SPI1 Transfer Done" edc:irq="10"/>
    <edc:Interrupt edc:cname="U1RXInterrupt" edc:desc="U1RX - UART1 Receiver" edc:irq="11"/>
    <edc:Interrupt edc:cname="U1TXInterrupt" edc:desc="U1TX - UART1 Transmitter" edc:irq="12"/>
    <edc:Interrupt edc:cname="ADC1Interrupt" edc:desc="ADC1 - A/D Converter 1" edc:irq="13"/>
    <edc:Interrupt edc:cname="SI2C1Interrupt" edc:desc="SI2C1 - I2C1 Slave Events" edc:irq="16"/>
    <edc:Interrupt edc:cname="MI2C1Interrupt" edc:desc="MI2C1 - I2C1 Master Events" edc:irq="17"/>
    <edc:Interrupt edc:cname="CompInterrupt" edc:desc="Comp - Comparator" edc:irq="18"/>
    <edc:Interrupt edc:cname="CNInterrupt" edc:desc="CN -  Change Notification Interrupt" edc:irq="19"/>
    <edc:Interrupt edc:cname="INT1Interrupt" edc:desc="INT1 - External Interrupt 1" edc:irq="20"/>
    <edc:Interrupt edc:cname="IC7Interrupt" edc:desc="IC7 - Input Capture 7" edc:irq="22"/>
    <edc:Interrupt edc:cname="IC8Interrupt" edc:desc="IC8 - Input Capture 8" edc:irq="23"/>
    <edc:Interrupt edc:cname="OC3Interrupt" edc:desc="OC3 - Output Compare 3" edc:irq="25"/>
    <edc:Interrupt edc:cname="OC4Interrupt" edc:desc="OC4 - Output Compare 4" edc:irq="26"/>
    <edc:Interrupt edc:cname="T4Interrupt" edc:desc="T4 - Timer4" edc:irq="27"/>
    <edc:Interrupt edc:cname="T5Interrupt" edc:desc="T5 - Timer5" edc:irq="28"/>
    <edc:Interrupt edc:cname="INT2Interrupt" edc:desc="INT2 - External Interrupt 2" edc:irq="29"/>
    <edc:Interrupt edc:cname="U2RXInterrupt" edc:desc="U2RX - UART2 Receiver" edc:irq="30"/>
    <edc:Interrupt edc:cname="U2TXInterrupt" edc:desc="U2TX - UART2 Transmitter" edc:irq="31"/>
    <edc:Interrupt edc:cname="SPI2ErrInterrupt" edc:desc="SPI2E - SPI2 Error" edc:irq="32"/>
    <edc:Interrupt edc:cname="SPI2Interrupt" edc:desc="SPI2 - SPI2 Transfer Done" edc:irq="33"/>
    <edc:Interrupt edc:cname="IC3Interrupt" edc:desc="IC3 - Input Capture 3" edc:irq="37"/>
    <edc:Interrupt edc:cname="IC4Interrupt" edc:desc="IC4 - Input Capture 4" edc:irq="38"/>
    <edc:Interrupt edc:cname="IC5Interrupt" edc:desc="IC5 - Input Capture 5" edc:irq="39"/>
    <edc:Interrupt edc:cname="IC6Interrupt" edc:desc="IC6 - Input Capture 6" edc:irq="40"/>
    <edc:Interrupt edc:cname="OC5Interrupt" edc:desc="OC5 - Output Compare 5" edc:irq="41"/>
    <edc:Interrupt edc:cname="OC6Interrupt" edc:desc="OC6 - Output Compare 6" edc:irq="42"/>
    <edc:Interrupt edc:cname="OC7Interrupt" edc:desc="OC7 - Output Compare 7" edc:irq="43"/>
    <edc:Interrupt edc:cname="OC8Interrupt" edc:desc="OC8 - Output Compare 8" edc:irq="44"/>
    <edc:Interrupt edc:cname="PMPInterrupt" edc:desc="PMP - Parallel Master Port" edc:irq="45"/>
    <edc:Interrupt edc:cname="SI2C2Interrupt" edc:desc="SI2C2 - I2C2 Slave Events" edc:irq="49"/>
    <edc:Interrupt edc:cname="MI2C2Interrupt" edc:desc="MI2C2 - I2C2 Master Events" edc:irq="50"/>
    <edc:Interrupt edc:cname="INT3Interrupt" edc:desc="INT3 - External Interrupt 3" edc:irq="53"/>
    <edc:Interrupt edc:cname="INT4Interrupt" edc:desc="INT4 - External Interrupt 4" edc:irq="54"/>
    <edc:Interrupt edc:cname="RTCCInterrupt" edc:desc="RTCC - Real-Time Clock and Calendar" edc:irq="62"/>
    <edc:Interrupt edc:cname="U1ErrInterrupt" edc:desc="U1E - UART1 Error" edc:irq="65"/>
    <edc:Interrupt edc:cname="U2ErrInterrupt" edc:desc="U2E - UART2 Error" edc:irq="66"/>
    <edc:Interrupt edc:cname="CRCInterrupt" edc:desc="CRC - Cyclic Redunancy Check" edc:irq="67"/>
    <edc:Interrupt edc:cname="LVDInterrupt" edc:desc="LVD - Low Voltage Detect" edc:irq="72"/>
    <edc:Interrupt edc:cname="CTMUInterrupt" edc:desc="CTMU - Interrupt" edc:irq="77"/>
    <edc:Interrupt edc:cname="U3ErrInterrupt" edc:desc="U3E - UART3 Error" edc:irq="81"/>
    <edc:Interrupt edc:cname="U3RXInterrupt" edc:desc="U3RX - UART3 Receiver" edc:irq="82"/>
    <edc:Interrupt edc:cname="U3TXInterrupt" edc:desc="U3TX - UART3 Transmitter" edc:irq="83"/>
    <edc:Interrupt edc:cname="SI2C3Interrupt" edc:desc="SI2C3 - I2C3 Slave Events" edc:irq="84"/>
    <edc:Interrupt edc:cname="MI2C3Interrupt" edc:desc="MI2C3 - I2C3 Master Events" edc:irq="85"/>
    <edc:Interrupt edc:cname="USB1Interrupt" edc:desc="USB1 - USB1 Interrupt" edc:irq="86"/>
    <edc:Interrupt edc:cname="U4ErrInterrupt" edc:desc="U4E - UART4 Error" edc:irq="87"/>
    <edc:Interrupt edc:cname="U4RXInterrupt" edc:desc="U4RX - UART4 Receiver" edc:irq="88"/>
    <edc:Interrupt edc:cname="U4TXInterrupt" edc:desc="U4TX - UART4 Transmitter" edc:irq="89"/>
    <edc:Interrupt edc:cname="SPI3ErrInterrupt" edc:desc="SPI3E - SPI3 Error" edc:irq="90"/>
    <edc:Interrupt edc:cname="SPI3Interrupt" edc:desc="SPI3 - SPI3 Transfer Done" edc:irq="91"/>
    <edc:Interrupt edc:cname="OC9Interrupt" edc:desc="OC9 - Output Compare 9" edc:irq="92"/>
    <edc:Interrupt edc:cname="IC9Interrupt" edc:desc="IC9 - Input Capture 9" edc:irq="93"/>
  </edc:InterruptList>
  <edc:WatchdogTimer edc:min="1"/>
  <edc:Breakpoints edc:hasdatacapture="true" edc:hwbpcount="0x5" edc:idbyte="x"/>
  <edc:ProgramSpace>
    <edc:ResetSector edc:beginaddr="0x0" edc:endaddr="0x4" edc:regionid="reset"/>
    <edc:VectorSector edc:beginaddr="0x04" edc:endaddr="0x100" edc:regionid="ivt"/>
    <edc:CodeSector edc:beginaddr="0x100" edc:endaddr="0x104" edc:isreserved="true" edc:regionid="_reserved"/>
    <edc:AltVectorSector edc:beginaddr="0x104" edc:endaddr="0x200" edc:regionid="aivt"/>
    <edc:CodeSector edc:beginaddr="0x200" edc:endaddr="0x2abf8" edc:regionid="program"/>
    <edc:WORMHoleSector edc:beginaddr="0x2abf8" edc:endaddr="0x2ac00" edc:regionid="cfgmem">
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x3" edc:srcaddr="0x2abfc" edc:srcmask="0x3"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0x20" edc:srcaddr="0x2abfc" edc:srcmask="0x20"/>
      <edc:WORMHole edc:dstaddr="0xf80008" edc:dstmask="0xc0" edc:srcaddr="0x2abfc" edc:srcmask="0xc0"/>
      <edc:WORMHole edc:dstaddr="0xf80006" edc:dstmask="0x7" edc:srcaddr="0x2abfc" edc:srcmask="0x700"/>
      <edc:WORMHole edc:dstaddr="0xf80006" edc:dstmask="0x80" edc:srcaddr="0x2abfc" edc:srcmask="0x8000"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0xf" edc:srcaddr="0x2abfe" edc:srcmask="0xf"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x10" edc:srcaddr="0x2abfe" edc:srcmask="0x10"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x40" edc:srcaddr="0x2abfe" edc:srcmask="0x40"/>
      <edc:WORMHole edc:dstaddr="0xf8000a" edc:dstmask="0x80" edc:srcaddr="0x2abfe" edc:srcmask="0x80"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x1" edc:srcaddr="0x2abfe" edc:srcmask="0x100"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x40" edc:srcaddr="0x2abfe" edc:srcmask="0x400"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x80" edc:srcaddr="0x2abfe" edc:srcmask="0x800"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x1" edc:srcaddr="0x2abfe" edc:srcmask="0x1000"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x2" edc:srcaddr="0x2abfe" edc:srcmask="0x2000"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x20" edc:srcaddr="0x2abfe" edc:srcmask="0x4000"/>
      <edc:WORMHole edc:dstaddr="0xf8000e" edc:dstmask="0x10" edc:srcaddr="0x2abfe" edc:srcmask="0x8000"/>
      <edc:AdjustPoint edc:offset="2"/>
      <edc:DCRDef edc:access="nnn----nnnnnnnnn" edc:cname="CONFIG3" edc:default="0xffff" edc:desc="" edc:impl="0xe1ff" edc:name="CONFIG3" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xe1ff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="WPFP" edc:desc="Write Protection Flash Page Segment Boundary" edc:mask="0x1ff" edc:name="WPFP" edc:nzwidth="9">
              <edc:DCRFieldSemantic edc:cname="WPFP0" edc:desc="Page 0 (0x00)" edc:when="(field &amp; 0x1ff) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="WPFP1" edc:desc="Page 1 (0x400)" edc:when="(field &amp; 0x1ff) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPFP2" edc:desc="Page 2 (0x800)" edc:when="(field &amp; 0x1ff) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="WPFP3" edc:desc="Page 3 (0xC00)" edc:when="(field &amp; 0x1ff) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="WPFP4" edc:desc="Page 4 (0x1000)" edc:when="(field &amp; 0x1ff) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="WPFP5" edc:desc="Page 5 (0x1400)" edc:when="(field &amp; 0x1ff) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="WPFP6" edc:desc="Page 6 (0x1800)" edc:when="(field &amp; 0x1ff) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="WPFP7" edc:desc="Page 7 (0x1C00)" edc:when="(field &amp; 0x1ff) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="WPFP8" edc:desc="Page 8 (0x2000)" edc:when="(field &amp; 0x1ff) == 0x8"/>
              <edc:DCRFieldSemantic edc:cname="WPFP9" edc:desc="Page 9 (0x2400)" edc:when="(field &amp; 0x1ff) == 0x9"/>
              <edc:DCRFieldSemantic edc:cname="WPFP10" edc:desc="Page 10 (0x2800)" edc:when="(field &amp; 0x1ff) == 0x0a"/>
              <edc:DCRFieldSemantic edc:cname="WPFP11" edc:desc="Page 11 (0x2C00)" edc:when="(field &amp; 0x1ff) == 0x0b"/>
              <edc:DCRFieldSemantic edc:cname="WPFP12" edc:desc="Page 12 (0x3000)" edc:when="(field &amp; 0x1ff) == 0x0c"/>
              <edc:DCRFieldSemantic edc:cname="WPFP13" edc:desc="Page 13 (0x3400)" edc:when="(field &amp; 0x1ff) == 0x0d"/>
              <edc:DCRFieldSemantic edc:cname="WPFP14" edc:desc="Page 14 (0x3800)" edc:when="(field &amp; 0x1ff) == 0x0e"/>
              <edc:DCRFieldSemantic edc:cname="WPFP15" edc:desc="Page 15 (0x3C00)" edc:when="(field &amp; 0x1ff) == 0x0f"/>
              <edc:DCRFieldSemantic edc:cname="WPFP16" edc:desc="Page 16 (0x4000)" edc:when="(field &amp; 0x1ff) == 0x010"/>
              <edc:DCRFieldSemantic edc:cname="WPFP17" edc:desc="Page 17 (0x4400)" edc:when="(field &amp; 0x1ff) == 0x011"/>
              <edc:DCRFieldSemantic edc:cname="WPFP18" edc:desc="Page 18 (0x4800)" edc:when="(field &amp; 0x1ff) == 0x012"/>
              <edc:DCRFieldSemantic edc:cname="WPFP19" edc:desc="Page 19 (0x4C00)" edc:when="(field &amp; 0x1ff) == 0x013"/>
              <edc:DCRFieldSemantic edc:cname="WPFP20" edc:desc="Page 20 (0x5000)" edc:when="(field &amp; 0x1ff) == 0x014"/>
              <edc:DCRFieldSemantic edc:cname="WPFP21" edc:desc="Page 21 (0x5400)" edc:when="(field &amp; 0x1ff) == 0x015"/>
              <edc:DCRFieldSemantic edc:cname="WPFP22" edc:desc="Page 22 (0x5800)" edc:when="(field &amp; 0x1ff) == 0x016"/>
              <edc:DCRFieldSemantic edc:cname="WPFP23" edc:desc="Page 23 (0x5C00)" edc:when="(field &amp; 0x1ff) == 0x017"/>
              <edc:DCRFieldSemantic edc:cname="WPFP24" edc:desc="Page 24 (0x6000)" edc:when="(field &amp; 0x1ff) == 0x018"/>
              <edc:DCRFieldSemantic edc:cname="WPFP25" edc:desc="Page 25 (0x6400)" edc:when="(field &amp; 0x1ff) == 0x019"/>
              <edc:DCRFieldSemantic edc:cname="WPFP26" edc:desc="Page 26 (0x6800)" edc:when="(field &amp; 0x1ff) == 0x01a"/>
              <edc:DCRFieldSemantic edc:cname="WPFP27" edc:desc="Page 27 (0x6C00)" edc:when="(field &amp; 0x1ff) == 0x01b"/>
              <edc:DCRFieldSemantic edc:cname="WPFP28" edc:desc="Page 28 (0x7000)" edc:when="(field &amp; 0x1ff) == 0x01c"/>
              <edc:DCRFieldSemantic edc:cname="WPFP29" edc:desc="Page 29 (0x7400)" edc:when="(field &amp; 0x1ff) == 0x01d"/>
              <edc:DCRFieldSemantic edc:cname="WPFP30" edc:desc="Page 30 (0x7800)" edc:when="(field &amp; 0x1ff) == 0x01e"/>
              <edc:DCRFieldSemantic edc:cname="WPFP31" edc:desc="Page 31 (0x7C00)" edc:when="(field &amp; 0x1ff) == 0x01F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP32" edc:desc="Page 32 (0x8000)" edc:when="(field &amp; 0x1ff) == 0x020"/>
              <edc:DCRFieldSemantic edc:cname="WPFP33" edc:desc="Page 33 (0x8400)" edc:when="(field &amp; 0x1ff) == 0x021"/>
              <edc:DCRFieldSemantic edc:cname="WPFP34" edc:desc="Page 34 (0x8800)" edc:when="(field &amp; 0x1ff) == 0x022"/>
              <edc:DCRFieldSemantic edc:cname="WPFP35" edc:desc="Page 35 (0x8C00)" edc:when="(field &amp; 0x1ff) == 0x023"/>
              <edc:DCRFieldSemantic edc:cname="WPFP36" edc:desc="Page 36 (0x9000)" edc:when="(field &amp; 0x1ff) == 0x024"/>
              <edc:DCRFieldSemantic edc:cname="WPFP37" edc:desc="Page 37 (0x9400)" edc:when="(field &amp; 0x1ff) == 0x025"/>
              <edc:DCRFieldSemantic edc:cname="WPFP38" edc:desc="Page 38 (0x9800)" edc:when="(field &amp; 0x1ff) == 0x026"/>
              <edc:DCRFieldSemantic edc:cname="WPFP39" edc:desc="Page 39 (0x9C00)" edc:when="(field &amp; 0x1ff) == 0x027"/>
              <edc:DCRFieldSemantic edc:cname="WPFP40" edc:desc="Page 40 (0xA000)" edc:when="(field &amp; 0x1ff) == 0x028"/>
              <edc:DCRFieldSemantic edc:cname="WPFP41" edc:desc="Page 41 (0xA400)" edc:when="(field &amp; 0x1ff) == 0x029"/>
              <edc:DCRFieldSemantic edc:cname="WPFP42" edc:desc="Page 42 (0xA800)" edc:when="(field &amp; 0x1ff) == 0x02A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP43" edc:desc="Page 43 (0xAC00)" edc:when="(field &amp; 0x1ff) == 0x02B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP44" edc:desc="Page 44 (0xB000)" edc:when="(field &amp; 0x1ff) == 0x02C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP45" edc:desc="Page 45 (0xB400)" edc:when="(field &amp; 0x1ff) == 0x02D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP46" edc:desc="Page 46 (0xB800)" edc:when="(field &amp; 0x1ff) == 0x02E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP47" edc:desc="Page 47 (0xBC00)" edc:when="(field &amp; 0x1ff) == 0x02F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP48" edc:desc="Page 48 (0xC000)" edc:when="(field &amp; 0x1ff) == 0x030"/>
              <edc:DCRFieldSemantic edc:cname="WPFP49" edc:desc="Page 49 (0xC400)" edc:when="(field &amp; 0x1ff) == 0x031"/>
              <edc:DCRFieldSemantic edc:cname="WPFP50" edc:desc="Page 50 (0xC800)" edc:when="(field &amp; 0x1ff) == 0x032"/>
              <edc:DCRFieldSemantic edc:cname="WPFP51" edc:desc="Page 51 (0xCC00)" edc:when="(field &amp; 0x1ff) == 0x033"/>
              <edc:DCRFieldSemantic edc:cname="WPFP52" edc:desc="Page 52 (0xD000)" edc:when="(field &amp; 0x1ff) == 0x034"/>
              <edc:DCRFieldSemantic edc:cname="WPFP53" edc:desc="Page 53 (0xD400)" edc:when="(field &amp; 0x1ff) == 0x035"/>
              <edc:DCRFieldSemantic edc:cname="WPFP54" edc:desc="Page 54 (0xD800)" edc:when="(field &amp; 0x1ff) == 0x036"/>
              <edc:DCRFieldSemantic edc:cname="WPFP55" edc:desc="Page 55 (0xDC00)" edc:when="(field &amp; 0x1ff) == 0x037"/>
              <edc:DCRFieldSemantic edc:cname="WPFP56" edc:desc="Page 56 (0xE000)" edc:when="(field &amp; 0x1ff) == 0x038"/>
              <edc:DCRFieldSemantic edc:cname="WPFP57" edc:desc="Page 57 (0xE400)" edc:when="(field &amp; 0x1ff) == 0x039"/>
              <edc:DCRFieldSemantic edc:cname="WPFP58" edc:desc="Page 58 (0xE800)" edc:when="(field &amp; 0x1ff) == 0x03A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP59" edc:desc="Page 59 (0xEC00)" edc:when="(field &amp; 0x1ff) == 0x03B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP60" edc:desc="Page 60 (0xF000)" edc:when="(field &amp; 0x1ff) == 0x03C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP61" edc:desc="Page 61 (0xF400)" edc:when="(field &amp; 0x1ff) == 0x03D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP62" edc:desc="Page 62 (0xF800)" edc:when="(field &amp; 0x1ff) == 0x03E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP63" edc:desc="Page 63 (0xFC00)" edc:when="(field &amp; 0x1ff) == 0x03F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP64" edc:desc="Page 64 (0x10000)" edc:when="(field &amp; 0x1ff) == 0x040"/>
              <edc:DCRFieldSemantic edc:cname="WPFP65" edc:desc="Page 65 (0x10400)" edc:when="(field &amp; 0x1ff) == 0x041"/>
              <edc:DCRFieldSemantic edc:cname="WPFP66" edc:desc="Page 66 (0x10800)" edc:when="(field &amp; 0x1ff) == 0x042"/>
              <edc:DCRFieldSemantic edc:cname="WPFP67" edc:desc="Page 67 (0x10C00)" edc:when="(field &amp; 0x1ff) == 0x043"/>
              <edc:DCRFieldSemantic edc:cname="WPFP68" edc:desc="Page 68 (0x11000)" edc:when="(field &amp; 0x1ff) == 0x044"/>
              <edc:DCRFieldSemantic edc:cname="WPFP69" edc:desc="Page 69 (0x11400)" edc:when="(field &amp; 0x1ff) == 0x045"/>
              <edc:DCRFieldSemantic edc:cname="WPFP70" edc:desc="Page 70 (0x11800)" edc:when="(field &amp; 0x1ff) == 0x046"/>
              <edc:DCRFieldSemantic edc:cname="WPFP71" edc:desc="Page 71 (0x11C00)" edc:when="(field &amp; 0x1ff) == 0x047"/>
              <edc:DCRFieldSemantic edc:cname="WPFP72" edc:desc="Page 72 (0x12000)" edc:when="(field &amp; 0x1ff) == 0x048"/>
              <edc:DCRFieldSemantic edc:cname="WPFP73" edc:desc="Page 73 (0x12400)" edc:when="(field &amp; 0x1ff) == 0x049"/>
              <edc:DCRFieldSemantic edc:cname="WPFP74" edc:desc="Page 74 (0x12800)" edc:when="(field &amp; 0x1ff) == 0x04A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP75" edc:desc="Page 75 (0x12C00)" edc:when="(field &amp; 0x1ff) == 0x04B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP76" edc:desc="Page 76 (0x13000)" edc:when="(field &amp; 0x1ff) == 0x04C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP77" edc:desc="Page 77 (0x13400)" edc:when="(field &amp; 0x1ff) == 0x04D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP78" edc:desc="Page 78 (0x13800)" edc:when="(field &amp; 0x1ff) == 0x04E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP79" edc:desc="Page 79 (0x13C00)" edc:when="(field &amp; 0x1ff) == 0x04F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP80" edc:desc="Page 80 (0x14000)" edc:when="(field &amp; 0x1ff) == 0x050"/>
              <edc:DCRFieldSemantic edc:cname="WPFP81" edc:desc="Page 81 (0x14400)" edc:when="(field &amp; 0x1ff) == 0x051"/>
              <edc:DCRFieldSemantic edc:cname="WPFP82" edc:desc="Page 82 (0x14800)" edc:when="(field &amp; 0x1ff) == 0x052"/>
              <edc:DCRFieldSemantic edc:cname="WPFP83" edc:desc="Page 83 (0x14C00)" edc:when="(field &amp; 0x1ff) == 0x053"/>
              <edc:DCRFieldSemantic edc:cname="WPFP84" edc:desc="Page 84 (0x15000)" edc:when="(field &amp; 0x1ff) == 0x054"/>
              <edc:DCRFieldSemantic edc:cname="WPFP85" edc:desc="Page 85 (0x15400)" edc:when="(field &amp; 0x1ff) == 0x055"/>
              <edc:DCRFieldSemantic edc:cname="WPFP86" edc:desc="Page 86 (0x15800)" edc:when="(field &amp; 0x1ff) == 0x056"/>
              <edc:DCRFieldSemantic edc:cname="WPFP87" edc:desc="Page 87 (0x15C00)" edc:when="(field &amp; 0x1ff) == 0x057"/>
              <edc:DCRFieldSemantic edc:cname="WPFP88" edc:desc="Page 88 (0x16000)" edc:when="(field &amp; 0x1ff) == 0x058"/>
              <edc:DCRFieldSemantic edc:cname="WPFP89" edc:desc="Page 89 (0x16400)" edc:when="(field &amp; 0x1ff) == 0x059"/>
              <edc:DCRFieldSemantic edc:cname="WPFP90" edc:desc="Page 90 (0x16800)" edc:when="(field &amp; 0x1ff) == 0x05A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP91" edc:desc="Page 91 (0x16C00)" edc:when="(field &amp; 0x1ff) == 0x05B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP92" edc:desc="Page 92 (0x17000)" edc:when="(field &amp; 0x1ff) == 0x05C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP93" edc:desc="Page 93 (0x17400)" edc:when="(field &amp; 0x1ff) == 0x05D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP94" edc:desc="Page 94 (0x17800)" edc:when="(field &amp; 0x1ff) == 0x05E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP95" edc:desc="Page 95 (0x17C00)" edc:when="(field &amp; 0x1ff) == 0x05F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP96" edc:desc="Page 96 (0x18000)" edc:when="(field &amp; 0x1ff) == 0x060"/>
              <edc:DCRFieldSemantic edc:cname="WPFP97" edc:desc="Page 97 (0x18400)" edc:when="(field &amp; 0x1ff) == 0x061"/>
              <edc:DCRFieldSemantic edc:cname="WPFP98" edc:desc="Page 98 (0x18800)" edc:when="(field &amp; 0x1ff) == 0x062"/>
              <edc:DCRFieldSemantic edc:cname="WPFP99" edc:desc="Page 99 (0x18C00)" edc:when="(field &amp; 0x1ff) == 0x063"/>
