balazsgrill/modembed/res/Devices/dsPIC30/PIC24FJ256GB110.PIC
              <edc:DCRFieldSemantic edc:cname="WPFP100" edc:desc="Page 100 (0x19000)" edc:when="(field &amp; 0x1ff) == 0x064"/>
              <edc:DCRFieldSemantic edc:cname="WPFP101" edc:desc="Page 101 (0x19400)" edc:when="(field &amp; 0x1ff) == 0x065"/>
              <edc:DCRFieldSemantic edc:cname="WPFP102" edc:desc="Page 102 (0x19800)" edc:when="(field &amp; 0x1ff) == 0x066"/>
              <edc:DCRFieldSemantic edc:cname="WPFP103" edc:desc="Page 103 (0x19C00)" edc:when="(field &amp; 0x1ff) == 0x067"/>
              <edc:DCRFieldSemantic edc:cname="WPFP104" edc:desc="Page 104 (0x1A000)" edc:when="(field &amp; 0x1ff) == 0x068"/>
              <edc:DCRFieldSemantic edc:cname="WPFP105" edc:desc="Page 105 (0x1A400)" edc:when="(field &amp; 0x1ff) == 0x069"/>
              <edc:DCRFieldSemantic edc:cname="WPFP106" edc:desc="Page 106 (0x1A800)" edc:when="(field &amp; 0x1ff) == 0x06A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP107" edc:desc="Page 107 (0x1AC00)" edc:when="(field &amp; 0x1ff) == 0x06B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP108" edc:desc="Page 108 (0x1B000)" edc:when="(field &amp; 0x1ff) == 0x06C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP109" edc:desc="Page 109 (0x1B400)" edc:when="(field &amp; 0x1ff) == 0x06D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP110" edc:desc="Page 110 (0x1B800)" edc:when="(field &amp; 0x1ff) == 0x06E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP111" edc:desc="Page 111 (0x1BC00)" edc:when="(field &amp; 0x1ff) == 0x06F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP112" edc:desc="Page 112 (0x1C000)" edc:when="(field &amp; 0x1ff) == 0x070"/>
              <edc:DCRFieldSemantic edc:cname="WPFP113" edc:desc="Page 113 (0x1C400)" edc:when="(field &amp; 0x1ff) == 0x071"/>
              <edc:DCRFieldSemantic edc:cname="WPFP114" edc:desc="Page 114 (0x1C800)" edc:when="(field &amp; 0x1ff) == 0x072"/>
              <edc:DCRFieldSemantic edc:cname="WPFP115" edc:desc="Page 115 (0x1CC00)" edc:when="(field &amp; 0x1ff) == 0x073"/>
              <edc:DCRFieldSemantic edc:cname="WPFP116" edc:desc="Page 116 (0x1D000)" edc:when="(field &amp; 0x1ff) == 0x074"/>
              <edc:DCRFieldSemantic edc:cname="WPFP117" edc:desc="Page 117 (0x1D400)" edc:when="(field &amp; 0x1ff) == 0x075"/>
              <edc:DCRFieldSemantic edc:cname="WPFP118" edc:desc="Page 118 (0x1D800)" edc:when="(field &amp; 0x1ff) == 0x076"/>
              <edc:DCRFieldSemantic edc:cname="WPFP119" edc:desc="Page 119 (0x1DC00)" edc:when="(field &amp; 0x1ff) == 0x077"/>
              <edc:DCRFieldSemantic edc:cname="WPFP120" edc:desc="Page 120 (0x1E000)" edc:when="(field &amp; 0x1ff) == 0x078"/>
              <edc:DCRFieldSemantic edc:cname="WPFP121" edc:desc="Page 121 (0x1E400)" edc:when="(field &amp; 0x1ff) == 0x079"/>
              <edc:DCRFieldSemantic edc:cname="WPFP122" edc:desc="Page 122 (0x1E800)" edc:when="(field &amp; 0x1ff) == 0x07A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP123" edc:desc="Page 123 (0x1EC00)" edc:when="(field &amp; 0x1ff) == 0x07B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP124" edc:desc="Page 124 (0x1F000)" edc:when="(field &amp; 0x1ff) == 0x07C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP125" edc:desc="Page 125 (0x1F400)" edc:when="(field &amp; 0x1ff) == 0x07D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP126" edc:desc="Page 126 (0x1F800)" edc:when="(field &amp; 0x1ff) == 0x07E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP127" edc:desc="Page 127 (0x1FC00)" edc:when="(field &amp; 0x1ff) == 0x07F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP128" edc:desc="Page 128 (0x20000)" edc:when="(field &amp; 0x1ff) == 0x080"/>
              <edc:DCRFieldSemantic edc:cname="WPFP129" edc:desc="Page 129 (0x20400)" edc:when="(field &amp; 0x1ff) == 0x081"/>
              <edc:DCRFieldSemantic edc:cname="WPFP130" edc:desc="Page 130 (0x20800)" edc:when="(field &amp; 0x1ff) == 0x082"/>
              <edc:DCRFieldSemantic edc:cname="WPFP131" edc:desc="Page 131 (0x20C00)" edc:when="(field &amp; 0x1ff) == 0x083"/>
              <edc:DCRFieldSemantic edc:cname="WPFP132" edc:desc="Page 132 (0x21000)" edc:when="(field &amp; 0x1ff) == 0x084"/>
              <edc:DCRFieldSemantic edc:cname="WPFP133" edc:desc="Page 133 (0x21400)" edc:when="(field &amp; 0x1ff) == 0x085"/>
              <edc:DCRFieldSemantic edc:cname="WPFP134" edc:desc="Page 134 (0x21800)" edc:when="(field &amp; 0x1ff) == 0x086"/>
              <edc:DCRFieldSemantic edc:cname="WPFP135" edc:desc="Page 135 (0x21C00)" edc:when="(field &amp; 0x1ff) == 0x087"/>
              <edc:DCRFieldSemantic edc:cname="WPFP136" edc:desc="Page 136 (0x22000)" edc:when="(field &amp; 0x1ff) == 0x088"/>
              <edc:DCRFieldSemantic edc:cname="WPFP137" edc:desc="Page 137 (0x22400)" edc:when="(field &amp; 0x1ff) == 0x089"/>
              <edc:DCRFieldSemantic edc:cname="WPFP138" edc:desc="Page 138 (0x22800)" edc:when="(field &amp; 0x1ff) == 0x08A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP139" edc:desc="Page 139 (0x22C00)" edc:when="(field &amp; 0x1ff) == 0x08B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP140" edc:desc="Page 140 (0x23000)" edc:when="(field &amp; 0x1ff) == 0x08C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP141" edc:desc="Page 141 (0x23400)" edc:when="(field &amp; 0x1ff) == 0x08D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP142" edc:desc="Page 142 (0x23800)" edc:when="(field &amp; 0x1ff) == 0x08E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP143" edc:desc="Page 143 (0x23C00)" edc:when="(field &amp; 0x1ff) == 0x08F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP144" edc:desc="Page 144 (0x24000)" edc:when="(field &amp; 0x1ff) == 0x090"/>
              <edc:DCRFieldSemantic edc:cname="WPFP145" edc:desc="Page 145 (0x24400)" edc:when="(field &amp; 0x1ff) == 0x091"/>
              <edc:DCRFieldSemantic edc:cname="WPFP146" edc:desc="Page 146 (0x24800)" edc:when="(field &amp; 0x1ff) == 0x092"/>
              <edc:DCRFieldSemantic edc:cname="WPFP147" edc:desc="Page 147 (0x24C00)" edc:when="(field &amp; 0x1ff) == 0x093"/>
              <edc:DCRFieldSemantic edc:cname="WPFP148" edc:desc="Page 148 (0x25000)" edc:when="(field &amp; 0x1ff) == 0x094"/>
              <edc:DCRFieldSemantic edc:cname="WPFP149" edc:desc="Page 149 (0x25400)" edc:when="(field &amp; 0x1ff) == 0x095"/>
              <edc:DCRFieldSemantic edc:cname="WPFP150" edc:desc="Page 150 (0x25800)" edc:when="(field &amp; 0x1ff) == 0x096"/>
              <edc:DCRFieldSemantic edc:cname="WPFP151" edc:desc="Page 151 (0x25C00)" edc:when="(field &amp; 0x1ff) == 0x097"/>
              <edc:DCRFieldSemantic edc:cname="WPFP152" edc:desc="Page 152 (0x26000)" edc:when="(field &amp; 0x1ff) == 0x098"/>
              <edc:DCRFieldSemantic edc:cname="WPFP153" edc:desc="Page 153 (0x26400)" edc:when="(field &amp; 0x1ff) == 0x099"/>
              <edc:DCRFieldSemantic edc:cname="WPFP154" edc:desc="Page 154 (0x26800)" edc:when="(field &amp; 0x1ff) == 0x09A"/>
              <edc:DCRFieldSemantic edc:cname="WPFP155" edc:desc="Page 155 (0x26C00)" edc:when="(field &amp; 0x1ff) == 0x09B"/>
              <edc:DCRFieldSemantic edc:cname="WPFP156" edc:desc="Page 156 (0x27000)" edc:when="(field &amp; 0x1ff) == 0x09C"/>
              <edc:DCRFieldSemantic edc:cname="WPFP157" edc:desc="Page 157 (0x27400)" edc:when="(field &amp; 0x1ff) == 0x09D"/>
              <edc:DCRFieldSemantic edc:cname="WPFP158" edc:desc="Page 158 (0x27800)" edc:when="(field &amp; 0x1ff) == 0x09E"/>
              <edc:DCRFieldSemantic edc:cname="WPFP159" edc:desc="Page 159 (0x27C00)" edc:when="(field &amp; 0x1ff) == 0x09F"/>
              <edc:DCRFieldSemantic edc:cname="WPFP160" edc:desc="Page 160 (0x28000)" edc:when="(field &amp; 0x1ff) == 0x0A0"/>
              <edc:DCRFieldSemantic edc:cname="WPFP161" edc:desc="Page 161 (0x28400)" edc:when="(field &amp; 0x1ff) == 0x0A1"/>
              <edc:DCRFieldSemantic edc:cname="WPFP162" edc:desc="Page 162 (0x28800)" edc:when="(field &amp; 0x1ff) == 0x0A2"/>
              <edc:DCRFieldSemantic edc:cname="WPFP163" edc:desc="Page 163 (0x28C00)" edc:when="(field &amp; 0x1ff) == 0x0A3"/>
              <edc:DCRFieldSemantic edc:cname="WPFP164" edc:desc="Page 164 (0x29000)" edc:when="(field &amp; 0x1ff) == 0x0A4"/>
              <edc:DCRFieldSemantic edc:cname="WPFP165" edc:desc="Page 165 (0x29400)" edc:when="(field &amp; 0x1ff) == 0x0A5"/>
              <edc:DCRFieldSemantic edc:cname="WPFP166" edc:desc="Page 166 (0x29800)" edc:when="(field &amp; 0x1ff) == 0x0A6"/>
              <edc:DCRFieldSemantic edc:cname="WPFP167" edc:desc="Page 167 (0x29C00)" edc:when="(field &amp; 0x1ff) == 0x0A7"/>
              <edc:DCRFieldSemantic edc:cname="WPFP168" edc:desc="Page 168 (0x2A000)" edc:when="(field &amp; 0x1ff) == 0x0A8"/>
              <edc:DCRFieldSemantic edc:cname="WPFP169" edc:desc="Page 169 (0x2A400)" edc:when="(field &amp; 0x1ff) == 0x0A9"/>
              <edc:DCRFieldSemantic edc:cname="WPFP170" edc:desc="Page 170 (0x2A800)" edc:when="(field &amp; 0x1ff) == 0x0AA"/>
              <edc:DCRFieldSemantic edc:cname="WPFP511" edc:desc="Highest Page (same as page 170)" edc:when="(field &amp; 0x1ff) == 0x1ff"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="RES1" edc:desc="Reserved" edc:ishidden="true" edc:islanghidden="true" edc:mask="0xf" edc:name="RES1" edc:nzwidth="0x4">
              <edc:DCRFieldSemantic edc:desc="Reserved" edc:when="(field &amp; 0xf) == 0xf"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPDIS" edc:desc="Segment Write Protection Disable bit" edc:mask="0x1" edc:name="WPDIS" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WPDIS" edc:desc="Segmented code protection disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPEN" edc:desc="Segmented code protection enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPCFG" edc:desc="Configuration Word Code Page Protection Select bit" edc:mask="0x1" edc:name="WPCFG" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WPCFGDIS" edc:desc="Last page(at the top of program memory) and Flash configuration words are not protected" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPCFGEN" edc:desc="Last page and Flash configuration words are code-protected" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="WPEND" edc:desc="Segment Write Protection End Page Select bit" edc:mask="0x1" edc:name="WPEND" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="WPENDMEM" edc:desc="Write Protect from WPFP to the last page of memory" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="WPSTARTMEM" edc:desc="Write Protect from page 0 to WPFP" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
      <edc:DCRDef edc:access="nnnnrnnnnnnnnrnn" edc:cname="CONFIG2" edc:default="0xf7ff" edc:desc="" edc:impl="0xffff" edc:name="CONFIG2" edc:nzwidth="0x10" edc:unimplval="0" edc:unused="0x0" edc:useinchecksum="0xf7ff">
        <edc:AliasList/>
        <edc:DCRModeList>
          <edc:DCRMode edc:id="DS.0">
            <edc:DCRFieldDef edc:cname="POSCMOD" edc:desc="Primary Oscillator Select" edc:mask="0x3" edc:name="POSCMOD" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="NONE" edc:desc="Primary oscillator disabled" edc:when="(field &amp; 0x3) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="HS" edc:desc="HS oscillator mode selected" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="XT" edc:desc="XT oscillator mode selected" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="EC" edc:desc="EC oscillator mode selected" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="I2C2SEL" edc:desc="I2C2 Pin Select bit" edc:ishidden="true" edc:mask="0x1" edc:name="I2C2SEL" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="PRI" edc:desc="Use Default SCL2/SDA2 pins for I2C2" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="SEC" edc:desc="Use alternate ASCL2/ASDA2 pins for I2C2" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="DISUVREG" edc:desc="Internal USB 3.3V Regulator Disable bit" edc:mask="0x1" edc:name="DISUVREG" edc:nzwidth="1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Regulator is disabled" edc:when="(field &amp; 0x1) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Regulator is enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IOL1WAY" edc:desc="IOLOCK One-Way Set Enable bit" edc:mask="0x1" edc:name="IOL1WAY" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="Unlimited Writes To RP Registers" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Write RP Registers Once" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="OSCIOFNC" edc:desc="Primary Oscillator Output Function" edc:mask="0x1" edc:name="OSCIOFNC" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="OSCO functions as port I/O (RC15)" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="OSCO functions as CLKO (FOSC/2)" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FCKSM" edc:desc="Clock Switching and Monitor" edc:mask="0x3" edc:name="FCKSM" edc:nzwidth="0x2">
              <edc:DCRFieldSemantic edc:cname="CSDCMD" edc:desc="Both Clock Switching and Fail-safe Clock Monitor are disabled" edc:when="(field &amp; 0x2) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="CSECMD" edc:desc="Clock switching is enabled, Fail-safe Clock Monitor is disabled" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="CSECME" edc:desc="Both Clock switching and Fail-safe Clock Monitor are enabled" edc:when="(field &amp; 0x3) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="FNOSC" edc:desc="Oscillator Select" edc:mask="0x7" edc:name="FNOSC" edc:nzwidth="0x3">
              <edc:DCRFieldSemantic edc:cname="FRCDIV" edc:desc="Fast RC oscillator with Postscaler (FRCDIV)" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="LPRC" edc:desc="Low-Power RC oscillator (LPRC)" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="SOSC" edc:desc="Secondary oscillator (SOSC)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="PRIPLL" edc:desc="Primary oscillator (XT, HS, EC) with PLL module (XTPLL,HSPLL, ECPLL)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="PRI" edc:desc="Primary oscillator (XT, HS, EC)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="FRCPLL" edc:desc="Fast RC oscillator with Postscaler and PLL module (FRCPLL)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="FRC" edc:desc="Fast RC Oscillator (FRC)" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PLL_96MHZ" edc:desc="96MHz PLL Disable" edc:mask="0x1" edc:name="PLL_96MHZ" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="Enabled" edc:when="(field &amp; 0x1) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="PLLDIV" edc:desc="USB 96 MHz PLL Prescaler Select bits" edc:mask="0x7" edc:name="PLLDIV" edc:nzwidth="3">
              <edc:DCRFieldSemantic edc:cname="DIV12" edc:desc="Oscillator input divided by 12 (48MHz input)" edc:when="(field &amp; 0x7) == 0x7"/>
              <edc:DCRFieldSemantic edc:cname="DIV10" edc:desc="Oscillator input divided by 10 (40MHz input)" edc:when="(field &amp; 0x7) == 0x6"/>
              <edc:DCRFieldSemantic edc:cname="DIV6" edc:desc="Oscillator input divided by 6 (24MHz input)" edc:when="(field &amp; 0x7) == 0x5"/>
              <edc:DCRFieldSemantic edc:cname="DIV5" edc:desc="Oscillator input divided by 5 (20MHz input)" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:DCRFieldSemantic edc:cname="DIV4" edc:desc="Oscillator input divided by 4 (16MHz input)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:DCRFieldSemantic edc:cname="DIV3" edc:desc="Oscillator input divided by 3 (12MHz input)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:DCRFieldSemantic edc:cname="DIV2" edc:desc="Oscillator input divided by 2 (8MHz input)" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:DCRFieldSemantic edc:cname="NODIV" edc:desc="Oscillator input used directly (4MHz input)" edc:when="(field &amp; 0x7) == 0x0"/>
            </edc:DCRFieldDef>
            <edc:DCRFieldDef edc:cname="IESO" edc:desc="Internal External Switch Over Mode" edc:mask="0x1" edc:name="IESO" edc:nzwidth="0x1">
              <edc:DCRFieldSemantic edc:cname="OFF" edc:desc="IESO mode (Two-speed start-up)disabled" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:DCRFieldSemantic edc:cname="ON" edc:desc="IESO mode (Two-speed start-up) enabled" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:DCRFieldDef>
          </edc:DCRMode>
        </edc:DCRModeList>
      </edc:DCRDef>
